cirias/nrf52832_remote_switch/app/main.c
APP_TIMER_DEF(m_motor_execute_timer_id);
APP_TIMER_DEF(m_motor_recover_timer_id);


static uint16_t m_conn_handle = BLE_CONN_HANDLE_INVALID;                        /**< Handle of the current connection. */

static uint8_t m_adv_handle = BLE_GAP_ADV_SET_HANDLE_NOT_SET;                   /**< Advertising handle used to identify an advertising set. */
static uint8_t m_enc_advdata[BLE_GAP_ADV_SET_DATA_SIZE_MAX];                    /**< Buffer for storing an encoded advertising set. */
static uint8_t m_enc_scan_response_data[BLE_GAP_ADV_SET_DATA_SIZE_MAX];         /**< Buffer for storing an encoded scan data. */

/**@brief Struct that contains pointers to the encoded advertising data. */
static ble_gap_adv_data_t m_adv_data =
{
    .adv_data =
    {
        .p_data = m_enc_advdata,
        .len    = BLE_GAP_ADV_SET_DATA_SIZE_MAX
    },
    .scan_rsp_data =
    {
        .p_data = m_enc_scan_response_data,
        .len    = BLE_GAP_ADV_SET_DATA_SIZE_MAX
    }
};

/*
 * #define WHITELIST_LEN 1
 * static const ble_gap_addr_t m_ble_addr_x1c7 =
 * {
 *   .addr_id_peer = 1,
 *   .addr_type    = BLE_GAP_ADDR_TYPE_PUBLIC,
 *   .addr         = BLE_ADDR_X1C7
 * };
 * static ble_gap_addr_t const* m_whitelist[WHITELIST_LEN] = {&m_ble_addr_x1c7};
 */

static const nrf_drv_timer_t m_timer = NRF_DRV_TIMER_INSTANCE(1);
static nrf_saadc_value_t     m_buffer_pool[2][SAMPLES_IN_BUFFER];
static nrf_ppi_channel_t     m_ppi_channel;
static uint32_t              m_adc_evt_counter;


/**@brief Function for assert macro callback.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num    Line number of the failing ASSERT call.
 * @param[in] p_file_name File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}


/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module.
 */
static void timers_init(void)
{
    // Initialize timer module, making it use the scheduler
    ret_code_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for the LEDs initialization.
 *
 * @details Initializes all LEDs used by the application.
 */
static void leds_init(void)
{
    bsp_board_init(BSP_INIT_LEDS);
}


/**@brief Function for the GAP initialization.
 *
 * @details This function sets up all the necessary GAP (Generic Access Profile) parameters of the
 *          device including the device name, appearance, and the preferred connection parameters.
 */
static void gap_params_init(void)
{
    ret_code_t              err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *)DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the GATT module.
 */
static void gatt_init(void)
{
    ret_code_t err_code = nrf_ble_gatt_init(&m_gatt, NULL);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling Queued Write Module errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void nrf_qwr_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for handling write events to the LED characteristic.
 *
 * @param[in] p_cus     Instance of LED Button Service to which the write applies.
 * @param[in] led_state Written/desired state of the LED.
 */
/*
 * static void led_write_handler(uint16_t conn_handle, ble_cus_t * p_cus, uint8_t led_state)
 * {
 *     if (led_state)
 *     {
 *         bsp_board_led_on(LEDBUTTON_LED);
 *         NRF_LOG_INFO("Received LED ON!");
 *     }
 *     else
 *     {
 *         bsp_board_led_off(LEDBUTTON_LED);
 *         NRF_LOG_INFO("Received LED OFF!");
 *     }
 * }
 */


static void motor_execute(uint8_t motor_op)
{
    motor_t * p_motor;
    uint32_t  duration;
    
    if ((motor_op & MOTOR_A) == MOTOR_A)
    {
        p_motor = &m_motor_a;
        duration = APP_TIMER_TICKS(210);
    }
    else
    {
        p_motor = &m_motor_b;
        duration = APP_TIMER_TICKS(170);
    }

    motor_enable(p_motor);

    if ((motor_op & MOTOR_OP_FORWARD) == MOTOR_OP_FORWARD)
    {
        motor_forward(p_motor);
    }
    else
    {
        motor_backward(p_motor);
    }

    app_timer_start(m_motor_execute_timer_id, duration, (void *)(uint32_t)motor_op);
}


static void motor_recover(uint8_t motor_op)
{
    motor_t * p_motor;
    uint32_t  duration;
    
    if ((motor_op & MOTOR_A) == MOTOR_A)
    {
        p_motor = &m_motor_a;
        duration = APP_TIMER_TICKS(80);
    }
    else
    {
        p_motor = &m_motor_b;
        duration = APP_TIMER_TICKS(60);
    }

    if ((motor_op & MOTOR_OP_FORWARD) == MOTOR_OP_FORWARD)
    {
        motor_backward(p_motor);
    }
    else
    {
        motor_forward(p_motor);
    }

    app_timer_start(m_motor_recover_timer_id, duration, NULL);
}


static void motor_execute_timeout_handler(void * p_context)
{
    motor_recover((uint8_t)(uint32_t)p_context);
}


static void motor_recover_timeout_handler(void * p_context)
{
    motor_disable(&m_motor_a);
    motor_disable(&m_motor_b);
}


static void motor_write_handler(uint16_t conn_handle, ble_cus_t * p_cus, uint8_t motor_op)
{
    motor_execute(motor_op);
}


/**@brief Function for initializing services that will be used by the application.
 */
static void services_init(void)
{
    ret_code_t         err_code;
    ble_cus_init_t     init     = {0};
    ble_bas_init_t     bas_init;
    nrf_ble_qwr_init_t qwr_init = {0};

    // Create timers
    err_code = app_timer_create(&m_motor_execute_timer_id,
                                APP_TIMER_MODE_SINGLE_SHOT,
                                motor_execute_timeout_handler);
    APP_ERROR_CHECK(err_code);

    err_code = app_timer_create(&m_motor_recover_timer_id,
                                APP_TIMER_MODE_SINGLE_SHOT,
                                motor_recover_timeout_handler);
    APP_ERROR_CHECK(err_code);


